Learning/C5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           polyBoundaryMesh;
    location        "constant/polyMesh";
    object          boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


7 // entry0
(
    inlet
    {
        type            patch;
        nFaces          220;
        startFace       167619;
    }
    outlet
    {
        type            patch;
        nFaces          114;
        startFace       167839;
    }
    minY
    {
        type            symmetryPlane;
        nFaces          583;
        startFace       167953;
    }
    maxY
    {
        type            symmetryPlane;
        nFaces          583;
        startFace       168536;
    }
    minZ
    {
        type            symmetryPlane;
        nFaces          1060;
        startFace       169119;
    }
    maxZ
    {
        type            symmetryPlane;
        nFaces          1060;
        startFace       170179;
    }
    solidSurfaces
    {
        type            wall;
        nFaces          6485;
        startFace       171239;
    }
)


// ************************************************************************* //
