Learning/C5/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |                                                 
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           
   \\    /   O peration     | Website:  https://openfoam.org                                       
    \\  /    A nd           | Version:  13                  
     \\/     M anipulation  |                                                 
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces ("Window_1.stl");

// Feature edges are extracted where adjacent triangle normals differ enough.
// This follows the reference case style, but targets the local STL.
// Mark edges whose adjacent surface normals are at an angle less
// than includedAngle as features
// - 0  : selects no edges
// - 180: selects all edges
includedAngle 150;

subsetFeatures
{
// Keep nonManifold edges (edges with >2 connected faces)
    nonManifoldEdges no;
    
// Keep open edges (edges with 1 connected face)
    openEdges        yes;
}

// Write features to obj format for postprocessing and viewing
writeObj yes;

// ************************************************************************* //
